Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: It may be noted that data transfer to and from the clipboard is quite similar to data transfer with drag and drop and the code to implement these two types is almost the same.
ja: クリップボードへの/からのデータ転送はドラッグ・アンド・ドロップによるデータ転送と非常に似ており、これらを実装するコードもほとんど同じです。

source: It may be noted that wxWidgets' event processing system implements something close to virtual methods in normal C++ in spirit: both of these mechanisms allow you to alter the behaviour of the base class by defining the event handling functions in the derived classes.
ja: wxWidgets の行うイベント処理の仕組みは通常の C++ の仮想関数にとても近いことに着目してください: 両方とも、継承クラスでイベント処理関数を定義することで基底クラスの振る舞いを置き換えることを可能にします。

source: It may be noted that wxWidgets' event processing system implements something very close to virtual methods in normal C++, i.e. it is possible to alter the behaviour of a class by overriding its event handling functions.
ja: wxWidgets の行うイベント処理の仕組みは通常の C++ の仮想関数にとても近いことに着目してください。つまり、イベント処理関数をオーバーライドすることでクラスの振る舞いを変更できるということです。

source: It may be used to enumerate all files, only files satisfying the given template mask or only non-hidden files.
ja: このクラスを使って、すべてのファイル、特定のパターンに一致するファイル、隠しファイル以外のファイルを列挙することができます。

source: It means that this information should be:
ja: つまり、取り扱う情報は次の条件を満たすべきです:

source: It only does anything at all in the debug mode (when the preprocessor symbol __WXDEBUG__ is defined) and expands to nothing in release mode (otherwise).
ja: デバッグモードの場合 (プリプロセッサシンボル __WXDEBUG__ が定義されている場合) のみ処理を行い、リリースモードの場合 (それ以外の場合) では空文字列に展開されます。

source: It should also show an appropriate message if data was not valid.
ja: また、データが正しくない場合は適切なメッセージを表示する必要があります。

source: It specifies the charset used by the catalog.
ja: これはカタログで使用される文字コードを指定しています。

source: It transfers the wxTextCtrl data back to this variable when the dialog is dismissed.
ja: ダイアログが閉じられたときに wxTextCtrl のデータをこの変数へ転送します。

source: It transfers the value of g_data.m_string (a wxString variable) to the wxTextCtrl when the dialog is initialised.
ja: ダイアログが初期化されたときに g_data.m_string (wxString 変数) の値を wxTextCtrl へ転送します。

source: It will also succeed if the current encoding is UTF-8 as all Unicode strings are representable in this encoding.
ja: また、Unicode 文字列はすべて UTF-8 で表現することが可能なため、現在のエンコーディングが UTF-8 である場合も常に成功します。

source: It will both make your code more familiar to other C++ programmers (who are supposed to have knowledge of std::string but not of wxString), let you reuse the same code in both wxWidgets and other programs (by just typedefing wxString as std::string when used outside wxWidgets) and by staying compatible with future versions of wxWidgets which will probably start using std::string sooner or later too.
ja: そうすることで、(std::string に関する知識はあっても wxString のことは知らないであろう) 他の C++ プログラマにとってより馴染みのあるコードにできますし、(wxWidgets 外でコードを使用するときは wxString を std::string として typedef することで) wxWidgets とそれ以外のプログラムで同じコードを再利用することもできます。また、wxWidgets の将来のバージョンとの互換性も保てます。なぜなら、遅かれ早かれ、おそらく wxWidgets で std::string を使用し始めるためです。

source: Iterating wxString's characters
ja: wxString の文字の走査

source: Just let us state once again the rules:
ja: もう一度だけルールを述べさせてください:

source: Just replace this line with this:
ja: この行を単純に次のように置き換えてください:

source: Last, note that there are also two simple global wrapper functions associated to the two wxEvtHandler mentioned functions: wxPostEvent() and wxQueueEvent().
ja: 最後に、前述の wxEvtHandler の関数に関連する、ふたつのグローバルラッパー関数があります: それは wxPostEvent() と wxQueueEvent() です。

source: Last, remember that if wxEventLoopBase::YieldFor() is used directly or indirectly (e.g. through wxProgressDialog) in your code, then you may have both re-entrancy problems and also problems caused by the processing of events out of order.
ja: 最後に、wxEventLoopBase::YieldFor() が直接または (例えば wxProgressDialog で) 間接的に使用される場合、再入可能性の問題とイベントが順不同に処理されることによる問題の両方が発生することを覚えておいてください。.

source: Let us now look at more examples of how to use different event handlers using the two overloads of Bind() function: first one for the object methods and the other one for arbitrary functors (callable objects, including simple functions):
ja: Bind() のふたつのオーバーロードを用いて、異なるイベントハンドラを使用する例を見てみましょう: 最初のオーバーロードはメンバ関数用で、もう一方は任意のファンクタ (単純な関数を含む、呼び出し可能なオブジェクト) 用です。

source: Let us now look at the details of this definition: the first line means that we are defining the event table for MyFrame class and that its base class is wxFrame, so events not processed by MyFrame will, by default, be handled by wxFrame.
ja: この定義を詳しく見ていきましょう: 最初の行は MyFrame クラスのイベントテーブルを定義しようとしており、基底クラスが wxFrame であることを意味しています。そのため、デフォルトでは MyFrame で処理されなかったイベントは wxFrame で処理されます。

source: Let us start by looking at the syntax: the first obvious difference is that you need not use wxDECLARE_EVENT_TABLE() nor wxBEGIN_EVENT_TABLE() and the associated macros.
ja: 構文を見ることから始めましょう: 最初の明らかな違いは wxDECLARE_EVENT_TABLE() や wxBEGIN_EVENT_TABLE()、およびそれらに関連するマクロを使用する必要がない点です。

source: Let's look at them in order.
ja: それではこれらを順番に見ていきましょう。

source: Let's take a quite simple but common case of a file error: suppose that you're writing your data file on disk and there is not enough space.
ja: 非常に単純で、よくあるファイルエラーの場合を考えてみましょう: データをディスク上のファイルに書き込もうとして充分な空き容量がなかったときを想像してください。

source: Like this, no memory is lost and 15 iterations from 16 in the example above won't allocate memory but use the already allocated pool.
ja: このように、メモリが無駄になることはありませんし、上記の例では 16 回の繰り返しのうち、15 回はメモリの割り当てが行われず、割り当て済みのプールが使用されます。

source: Like with all the other GUI frameworks, the control of flow in wxWidgets applications is event-based: the program normally performs most of its actions in response to the events generated by the user.
ja: 他のすべての GUI フレームワークのように、wxWidgets アプリケーションはイベントベースで処理の制御を行います: 一般的に、プログラムの処理の大半はユーザの生成するイベントに応じて行われます。

source: Like wxLogError(), but also terminates the program with the exit code 3.
ja: wxLogError() と似ていますが、リターンコード 3 でプログラムを終了させます。

source: List of wxWidgets events
ja: wxWidgets のイベント一覧

source: Literal strings (i.e. "Hello, world!" or '*')
ja: リテラル文字列 (すなわち "Hello, world!" や '*')

source: Loads the file history from the given config object.
ja: 指定されたコンフィグオブジェクトからファイルの履歴を読み込みます。

source: Locales
ja: ロケール

source: Log Messages Selection
ja: ログメッセージの選択

source: Log Targets
ja: ログターゲット

source: Log a message at wxLOG_Trace log level (see wxLogLevelValues enum).
ja: wxLOG_Trace ログレベル (wxLogLevelValues enum 参照) のメッセージを記録します。

source: Logging Customization
ja: ロギングのカスタマイズ

source: Logging in Multi-Threaded Applications
ja: マルチスレッドアプリケーションでのロギング

source: Luckily, there is another way - see the next section.
ja: 幸運なことに、別の方法があります。次の章を参照してください。

source: Macro to be used around all literal strings that should be translated.
ja: 翻訳対象となるすべてのリテラル文字列に対して使用するマクロです。

source: Macros listed by event class
ja: イベントクラスごとのマクロ

source: Main Page
ja: メインページ

source: Many applications should therefore be able to adapt to small displays with little or no work, as far as dialogs are concerned.
ja: したがって、ダイアログのことを気にかけている限り、少し、もしくはまったく手を加えることなく、多くのアプリケーションを小さな画面に適応させることができるはずです。

source: Merges the window's best size into the min size and returns the result.
ja: ウィンドウの最適サイズを最小サイズにマージし、その結果を返却します。

source: Message catalog resources category.
ja: メッセージカタログを表すリソースカテゴリ。

source: Message sent to the client application when the server notifies it of a change in the data associated...
ja: Advice() を使用し、指定した項目に関連するデータの変更をサーバが通知するときにクライアントアプリケーションへ送信されるメッセージ。

source: Messages between applications are usually identified by three variables: connection object, topic name and item name.
ja: 通常、アプリケーション間のメッセージは 3 種類の変数で識別されます: コネクションオブジェクト、トピック名、アイテム名です。

source: Messages logged by this function will appear in the statusbar of the frame or of the top level applic...
ja: この関数でロギングされたメッセージはデフォルトでフレームまたはトップレベルウィンドウのステータスバーに表示されます。

source: Messages logged from threads other than the main one will be buffered until wxLog::Flush() is called in the main thread (which usually happens during idle time, i.e. after processing all pending events) and will be really output only then.
ja: メインスレッド以外のスレッドで記録されたメッセージはメインスレッドで wxLog::Flush() が呼ばれるまで (通常はアイドル時、つまり、未処理のイベントがすべて処理された後に呼ばれます) バッファリングされ、wxLog::Flush() が呼ばれたときに初めて実際に出力されます。

source: Miscellaneous Notes
ja: 雑多な覚書

source: Miscellaneous Other Changes
ja: 他の雑多な変更

source: More DDE Details
ja: DDE の詳細

source: More details about Unicode may be found at http://www.unicode.org/.
ja: Unicode についての詳細は http://www.unicode.org/ にあります。

source: More details about Unicode may be found at www.unicode.org.
ja: Unicode についての詳細は www.unicode.org にあります。

source: More precisely, a code unit is the minimal bit combination that can represent a unit of encoded text for processing or interchange.
ja: より正確に言うと、コード単位とは、テキスト処理または交換のために符号化された文字を表現可能な最小のビットの組み合わせです。

source: More precisely, as said above, all event classes not deriving from wxCommandEvent (see the wxEvent inheritance map) do not propagate upward.
ja: より正確に言うと、前に述べたように wxCommandEvent を継承して いない イベントクラス (wxEvent の継承マップ参照) はどれも伝播 しません。

source: More rarely used, but still useful, is wc_str() function which always returns the Unicode string.
ja: めったに使われませんが、便利な関数として wc_str() 関数があり、これは常に Unicode 文字列を返却します。

source: Moreover, wxStdInputStream and wxStdOutputStream classes are provided to provide a degree of interoperability between the two and make it possible to use any wxWidgets stream as a standard stream (the converse possibility to use a standard stream as a wxWidgets stream is planned for a future release).
ja: さらに、ある程度の相互運用性を wxWidgets と 標準ストリームクラスとの間に提供するため、wxStdInputStream クラスと wxStdOutputStream クラスが提供されています。これらのクラスにより、任意の wxWidgets ストリームを標準ストリームとして使用できます。(逆に標準ストリームを wxWidgets ストリームとして使用する機能は将来的に提供する予定です)

source: Moreover, any application reading files which it didn't produce or receiving data from the network from other services should be ready to deal with Unicode.
ja: さらに、アプリケーション外で作成されたファイルを読み込んだり、ネットワーク経由で他のサービスからデータを読み込んだりするアプリケーションは Unicode を取り扱う準備をしておくべきです。

source: Moreover, in the Windows NT/2000 case, even the program which uses only standard ASCII can profit from using Unicode because they will work more efficiently - there will be no need for the system to convert all strings the program uses to/from Unicode each time a system call is made.
ja: さらに Windows NT/2000 の場合、標準的な ASCII モードのみを使用するプログラムであっても Unicode の恩恵を得ることができます。 なぜなら、システムコールを実行するたびにすべての文字列を Unicode に/から 変換する必要がないため、より効率的にプログラムが動作できるためです。

source: Moreover, some very useful functions are not standard at all.
ja: その上、いくつかの非常に便利な関数は標準関数ではありません。

source: Moreover, the log level can be set separately for different log components.
ja: さらに、異なるログコンポーネント間で別々にログレベルを設定することも可能です。

source: Moreover, the second version of this function takes a trace mask as the first argument which allows to further restrict the amount of messages generated.
ja: くわえて、2 番目の形式では第一引数としてトレースマスクを指定できるため、生成されるメッセージの量をさらに制限することができます。

source: Most DDE transactions operate on this object.
ja: ほとんどの DDE トランザクションはこのオブジェクト上で行われます。

source: Most controls will also set the min size to the size given in the control's constructor if a non-default value is passed.
ja: また、大半のコントロールはコンストラクタにデフォルト値以外の値が指定された場合にそれを最小サイズとして設定します。

source: Most controls will also set the minimal size to the size given in the control's constructor if a non-default value is passed.
ja: また、大半のコントロールはコンストラクタにデフォルト値以外の値が指定された場合にそれを最小サイズとして設定します。

source: Most windows can use the generic styles listed for wxWindow in addition to their own styles.
ja: ほとんどのウィンドウは独自のスタイルに加えて wxWindow の汎用的なスタイルを使用できます。

source: Mostly used by wxWidgets itself, but might be handy for logging errors after system call (API functio...
ja: 主に wxWidgets 自身で使用されますが、システムコール (API 関数) の失敗後のエラーログを記録するのに便利かもしれません。

source: Mouse event macros can handle either individual mouse events or all mouse events.
ja: マウスイベントマクロは個別のマウスやすべてのマウスのイベントを処理することができます。

source: Much work has been done to make existing code using ANSI string literals work as before version 3.0.
ja: ANSI リテラル文字列を使用する既存のコードを 3.0 以前のバージョンと同じように動作させるために様々なことを行っています。

source: Multithreading Overview
ja: マルチスレッドの概要

source: Nevertheless wxWidgets programs can also use standard stream classes and are encouraged to do so if the above considerations don't apply.
ja: とは言え、wxWidgets プログラムで標準ストリームクラスを使用することも可能ですし、上記の事項が当てはまらない場合は使用が推奨されています。

source: Next the event table must be defined and, as with any definition, it must be placed in an implementation file.
ja: 次に、イベントテーブルを定義する必要があります。これは必ずソースファイル内に配置しなければなりません。

source: No event-free alternatives
ja: イベントを送信しない代替方法を持たない

source: Non-English Strings or 8-bit Characters in Source
ja: ソース中の非英語文字列や 8 ビット文字

source: Non-English strings or 8-bit characters in the source code
ja: ソースコード中の非英語文字列や 8 ビット文字

source: Non-alpha characters are filtered out.
ja: 非アルファベット文字を除外します。

source: None (stock cursors only).
ja: なし (既存のカーソルのみ)

source: Normally, it is suppressed, but might be activated if the user wishes to know more details about the program progress (another, but possibly confusing name for the same function is wxLogInfo).
ja: 通常は出力されませんが、ユーザがプログラムの進捗状況についてより詳しく知りたい場合に有効化されるかもしれません。 (名前の紛らわしい同じ機能の関数として wxLogInfo があります)

source: Normally, the prefix is hard-coded and is the same as the value passed to configure via the --prefix switch when compiling the library (typically /usr/local or /usr).
ja: 通常、プレフィックスはハードコーディングされており、ライブラリのコンパイル時に --prefix スイッチによって configure へ渡される値と同じです。 (普通は /usr/local か /usr です)

source: Normally, you will call wxWindow::SetDropTarget during window creation associating your drop target with it.
ja: 通常はドロップ先へ関連付けるウィンドウの作成中に wxWindow::SetDropTarget を呼び出します。

source: Not performance critical, neither from speed nor from a memory consumption point of view.
ja: 実行速度やメモリ消費量といった観点の性能が重要視されない。

source: Not so with Bind<>() which can be used to specify these handlers which will handle the event.
ja: Bind<>() ではこれらのイベントハンドラを指定できるため、そのようなことはありません。

source: Notably, under Unix, the underlying graphical toolkit (e.g. GTK+) usually uses UTF-8 encoded strings and using the same representations for the strings in wxWidgets allows to avoid conversion from UTF-32 to UTF-8 and vice versa each time a string is shown in the UI or retrieved from it.
ja: 特に、Unix のグラフィカルツールキット ( GTK+ など) は普通、UTF-8 文字列を使用しており、wxWidgets でも同じ符号化方式を使用することで、UI に文字列を表示するときや逆に文字列を取得するときに毎回 UTF-32 から UTF-8 に変換する必要がなくなります。

source: Note however that other classes like wxMemoryBuffer are more suited to this task.
ja: ただし、wxMemoryBuffer のように、このことを行なうためのより適切なクラスが他に存在します。

source: Note that wxSizer does not derive from wxWindow and thus does not interfere with tab ordering and requires very few resources compared to a real window on screen.
ja: wxSizer は wxWindow を継承していないため、タブ順に干渉することがなく、実際のウィンドウと比較するとほとんどリソースを必要としません。

source: Note that MyFrameHandler doesn't need to derive from wxEvtHandler.
ja: MyFrameHandler は wxEvtHandler を継承している必要がないことに注意してください。

source: Note that this pointer must be specified here.
ja: ここでは this ポインタを指定する必要があることに注意してください。

source: Note that wxUSE_DRAG_AND_DROP must be defined in setup.h in order to use drag and drop in wxWidgets.
ja: wxWidgets でドラッグ・アンド・ドロップを使用するには、setup.h で wxUSE_DRAG_AND_DROP を定義する必要があることに注意してください。

source: Note that any wxWindow may have a validator; using the wxWS_EX_VALIDATE_RECURSIVELY style (see wxWindow extended styles) you can also implement recursive validation.
ja: どの wxWindow もバリデータを持つことに注意してください; wxWS_EX_VALIDATE_RECURSIVELY スタイル (wxWindow の拡張スタイルを参照) を使用すると再帰バリデータを実装することも可能です。

source: Note that from the C/C++ programmer perspective the situation is further complicated by the fact that the standard type wchar_t which is usually used to represent the Unicode ("wide") strings in C/C++ doesn't have the same size on all platforms.
ja: C/C++ プログラマの観点からすれば、状況はもっと複雑です。というのも、C/C++ で Unicode ( "ワイド" ) 文字列を表現するためによく使われる wchar_t 型は、すべてのプラットフォームで同じサイズとは限らないためです。

source: Note that missing or partially-implemented formats are automatically supplemented by the wxImage to load the data, and then converting it to wxBitmap form.
ja: 対応していない、または部分的にしか実装されていない形式は自動的に wxImage を使用してデータの読み込みと wxBitmap 形式への変換が行われることに注意してください。

source: Note that missing or partially-implemented formats are automatically supplemented by using wxImage to load the data, and then converting it to wxBitmap form.
ja: 対応していない、または部分的にしか実装されていない形式は自動的に wxImage を使用してデータの読み込みと wxBitmap 形式への変換が行われることに注意してください。

source: Note that only some controls can calculate their size (such as a checkbox) whereas others (such as a listbox) don't have any natural width or height and thus require an explicit size.
ja: (チェックボックスなどの) いくつかのコントロールのみが自身のサイズを計算できるのに対し、(リストボックスなどの) 他のコントロールはデフォルトの幅や高さを持たないため、明示的にサイズを指定する必要がある点に注意してください。

source: Note that starting from wxWidgets 2.3.3 such logic doesn't apply for the windows shown before the program enters the main loop: in other words, you can safely show a dialog from wxApp::OnInit and not be afraid that your application terminates when this dialog -- which is the last top level window for the moment -- is closed.
ja: wxWidgets 2.3.3 から、このロジックはメインループに入る前のまだ表示されていないウィンドウには適用されなくなりました。つまり、 wxApp::OnInit の中で安全にダイアログを表示でき、ダイアログ (その時点における最後のトップレベルウィンドウ) を閉じるときにアプリケーションが終了することを心配しなくても良いということです。

source: Note that such logic doesn't apply for the windows shown before the program enters the main loop: in other words, you can safely show a dialog from wxApp::OnInit and not be afraid that your application terminates when this dialog -- which is the last top level window for the moment -- is closed.
ja: このロジックはメインループに入る前のまだ表示されていないウィンドウには適用されないことに注意してください。つまり、 wxApp::OnInit の中で安全にダイアログを表示でき、ダイアログ (その時点における最後のトップレベルウィンドウ) を閉じるときにアプリケーションが終了することを心配しなくても良いということです。

source: Note that the new way of specifying flags to wxSizer is via wxSizerFlags.
ja: wxSizer にフラグを指定する新しい方法として wxSizerFlags を使用する方法があります。

source: Note that the program's command line arguments, represented by argc and argv, are available from within wxApp member functions.
ja: プログラムのコマンドライン引数 (argc と argv) は wxApp のメンバ関数から使用できます。

source: Note that this macro doesn't need a window identifier, since normally you are only interested in the current window's size events.
ja: このマクロはウィンドウ識別子を必要としません。なぜなら、通常は現在のウィンドウのリサイズイベントにのみ関心があるはずだからです。

source: Note that this macro may occur in any section of the class (public, protected or private) but that it is probably better to insert it at the end, as shown, because this macro implicitly changes the access to protected which may be quite unexpected if there is anything following it.
ja: このマクロはクラスの任意の場所 (public、protected、private) に配置することができますが、おそらく例示のように最後に挿入する方が良いでしょう。なぜなら、このマクロは暗黙的にアクセス制御を protected に変更してしまうためです。

source: Note that this static box has to be created separately.
ja: このスタティックボックスは別々に作成する必要があることに注意してください。

source: Note that typically one character is assigned exactly one code point, but there are exceptions; the so-called precomposed characters (see http://en.wikipedia.org/wiki/Precomposed_character) or the ligatures.
ja: 通常、ひとつの文字は厳密にひとつのコードポイントに割り当てられますが、なかには例外もあります; いわゆる 合成済み文字 (http://en.wikipedia.org/wiki/Precomposed_character 参照) や 合字 (リガチャ) のことです。

source: Note that under Windows, you must either run the program under debugger or use a 3rd party program such as DebugView (http://www.microsoft.com/technet/sysinternals/Miscellaneous/DebugView.mspx) to actually see the debug output.
ja: Windows でデバッグ出力を確認するためにはデバッガーを使用するか、DbgView (http://www.microsoft.com/technet/sysinternals/Miscellaneous/DebugView.mspx) のようなサードパーティーのプログラムを使用する必要がある点に注意してください。

source: Note that using wxImage is the preferred way to load images in wxWidgets, with the exception of resources (XPM-files or native Windows resources).
ja: wxWidgets で画像を読み込む場合、リソース (XPM ファイルや Windows のリソース) から読み込む場合を除くと、wxImage を利用した方が良いことにも注意してください。

source: Note that while the behaviour of wxString when wxUSE_UNICODE_WCHAR==1 resembles UCS-2 encoding, it's not completely correct to refer to wxString as UCS-2 encoded since you can encode code points outside the BMP in a wxString as two code units (i.e. as a surrogate pair; as already mentioned however wxString will "see" them as two different code points)
ja: wxUSE_UNICODE_WCHAR==1 のときの wxString の振る舞いは UCS-2 エンコーディングに似ていますが、wxString を完全に UCS-2 エンコーディングとみなすことはできません。なぜなら、BMP 以外のコードポイントをふたつのコードポイントとして (つまり、サロゲートペアとして; ただし、すでに述べたように wxString はそれらを異なるふたつのコードポイントとして扱います) wxString に格納することができるためです。

source: Note that you can get the object that generated the event -- and that is not the same as the frame -- via wxEvent::GetEventObject() method of event argument passed to the event handler.
ja: イベントハンドラへ渡された event 引数の wxEvent::GetEventObject() 関数によって、イベントを生成したオブジェクトを取得できます。 (このオブジェクトはフレームではありません)

source: Note that your application may wish to override ProcessEvent to redirect processing of events.
ja: ProcessEvent をオーバーライドすることでイベント処理をリダイレクトしたいと思うかもしれません。

source: Note the use of IMPLEMENT_APP(appClass), which allows wxWidgets to dynamically create an instance of the application object at the appropriate point in wxWidgets initialization.
ja: IMPLEMENT_APP(appClass) を使用している点に注意してください。これにより、wxWidgets の初期化時の適切なタイミングでアプリケーションオブジェクトのインスタンスが動的に作成されるようになります。

source: Note this particular line:
ja: この行に注目してください:

source: Note:
ja: 注:

source: Note: Since mb_str() returns a temporary wxCharBuffer to hold the result of the conversion, you need to explicitly cast it to const char* if you use it in a vararg context (like with printf).
ja: 注: mb_str() は変換結果を保持する一時 wxCharBuffer を返却するため、(printf のような) 可変数引数の関数を使用する場合は明示的に const char* にキャストする必要があります。

source: Note: This is supported only by wxBoxSizer and wxFlexGridSizer.
ja: 注: これは wxBoxSizer と wxFlexGridSizer でのみサポートされています。

source: Notice that Unicode support has changed radically in wxWidgets 3.0 and a lot of existing material pertaining to the previous versions of the library is not correct any more.
ja: wxWidgets 3.0 では Unicode の対応方法が大きく変わるため、以前のバージョンに関連する多くのことが、もはや正しくなくなることに注意してください。

source: Notice that by including wx/ipc.h> you may define convenient synonyms for the IPC classes: wxServer for either wxDDEServer or wxTCPServer depending on whether DDE-based or socket-based implementation is used and the same thing for wxClient and wxConnection.
ja: wx/ipc.h> をインクルードすることで IPC クラス用の便利なシノニムを定義できます: DDE ベースの実装とソケットベースの実装のどちらを使用するかによって wxDDEServer もしくは wxTCPServer のいずれかが wxServer として定義されます。同様のことが wxClient と wxConnection に対しても行われます。

source: Notice that by including <wx/ipc.h> you may define convenient synonyms for the IPC classes: wxServer for either wxDDEServer or wxTCPServer depending on whether DDE-based or socket-based implementation is used and the same thing for wxClient and wxConnection.
ja: <wx/ipc.h> をインクルードすることで IPC クラス用の便利なシノニムを定義できます: DDE ベースの実装とソケットベースの実装のどちらを使用するかによって wxDDEServer もしくは wxTCPServer のいずれかが wxServer として定義されます。同様のことが wxClient と wxConnection に対しても行われます。

source: Notice that if you just need to modify (or suppress) the time stamp display, overriding FormatTime() is enough.
ja: ただし、タイムスタンプの形式を変更 (または出力を抑制) したいだけの場合、FormatTime() をオーバーライドするだけで充分です。

source: Notice that in the latter case you should be prepared for logging messages early during the program startup and also during program shutdown so you shouldn't rely on existence of the main application window, for example.
ja: 後者の場合、例えばプログラムの起動時に早くメッセージのロギングの準備をする必要があり、プログラムの終了時にはメインウィンドウの存在に依存してはいけない点に注意してください。

source: Notice that the default GUI logger already only output the messages when it is flushed, so by default messages from the other threads will be shown more or less at the same moment as usual.
ja: デフォルトの GUI ロガーはフラッシュされるときに初めてメッセージを出力するようにすでになっているため、他スレッドのメッセージは通常どおり、ほぼ同時に表示されます。
